Tekla Open API Reference for Tekla Structures 2025
ReinforcementCatalog Properties
The ReinforcementCatalog type exposes the following members.
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedRebarBendingRadius
 Gets the selected rebar bending radius in the control.
SelectedRebarGrade
 Gets the selected rebar grade in the control.
SelectedRebarSize
 Gets the selected rebar size in the control.
Top
See Also
Reference
ReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace